Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/adc/hal_adc_driver.cpp
	adcNumSamples = numSamples;

	dualADCMode = TRUE;


	TIM_Cmd(TIM3, ENABLE);

	return DS_Success;
}


DeviceStatus AD_ConfigureScanModeThreeChannels(UINT16* sampleBuff1, UINT16* sampleBuff2, UINT16* sampleBuff3, UINT32 numSamples, UINT32  samplingTimeRadar, HAL_CALLBACK_FPN userCallback, void* Param)
{
	ADC_InitTypeDef           ADC_InitStructure;
	DMA_InitTypeDef           DMA_InitStructure;
	TIM_TimeBaseInitTypeDef   TIM_TimeBaseStructure;
	TIM_OCInitTypeDef         TIM_OCInitStructure;

	UINT32 periodRadar, periodAudio;
	UINT32 prescalerRadar, prescalerAudio;
	UINT32 samplingTimeAudio;

	ADC_RCC_Configuration();

	ADC_GPIO_Configuration();


	if( !CPU_INTC_ActivateInterrupt(STM32_AITC::c_IRQ_INDEX_DMA_CHANNEL1, DMA_HAL_HANDLER_FOR_RADAR, NULL) )
		return DS_Fail;

	//if( !CPU_INTC_ActivateInterrupt(STM32_AITC::c_IRQ_INDEX_DMA2_Channel4_5, DMA_HAL_HANDLER_FOR_AUDIO, NULL) )
		//return DS_Fail;

	//if(!CPU_INTC_InterruptEnable(STM32_AITC::c_IRQ_INDEX_DMA2_Channel4_5))
		//return DS_Fail;

	//if( !CPU_INTC_ActivateInterrupt(STM32_AITC::c_IRQ_INDEX_ADC1_2, ADC_HAL_HANDLER, NULL) )
		//return DS_Fail;

	if( !CPU_INTC_ActivateInterrupt(STM32_AITC::c_IRQ_INDEX_ADC3, ADC_HAL_HANDLER, NULL) )
		return DS_Fail;

	//if(!CPU_INTC_InterruptEnable(STM32_AITC::c_IRQ_INDEX_ADC3))
		//return DS_Fail;

	//if( !CPU_INTC_ActivateInterrupt(STM32_AITC::c_IRQ_INDEX_TIM3, TIM_HAL_HANDLER, NULL) )
		//return DS_Fail;

	//if( !CPU_INTC_ActivateInterrupt(STM32_AITC::c_IRQ_INDEX_TIM8_BRK_TIM12, TIM_HAL_HANDLER, NULL) )
		//return DS_Fail;

	/*if(!ADC_NVIC_Configuration())
		return DS_Fail;*/

	g_callback = userCallback;

	if(Param != NULL)
	{
		Param = &g_timeStamp;
	}

	g_adcUserBufferChannel1Ptr = sampleBuff1;
	g_adcUserBufferChannel2Ptr = sampleBuff2;
	g_adcUserBufferChannel3Ptr = sampleBuff3;

	adcNumSamplesRadar = numSamples/8;
	adcNumSamplesAudio = numSamples;
	samplingTimeAudio = samplingTimeRadar/8;
	dualADCMode = TRUE;


	RCC_ClocksTypeDef RCC_Clocks;
	RCC_GetClocksFreq(&RCC_Clocks);

	if (RCC_Clocks.HCLK_Frequency == RCC_Clocks.PCLK1_Frequency) {
		// No prescaler, so TIM clock == PCLK1
		periodRadar = samplingTimeRadar * (RCC_Clocks.PCLK1_Frequency/1000000);
		periodAudio = samplingTimeAudio * (RCC_Clocks.PCLK1_Frequency/1000000);
	}
	else {
		// Prescaler, so TIM clock = PCLK1 x 2
		periodRadar = samplingTimeRadar * (RCC_Clocks.PCLK1_Frequency*2/1000000);
		periodAudio = samplingTimeAudio * (RCC_Clocks.PCLK1_Frequency*2/1000000);
		//period = samplingTime * (RCC_Clocks.PCLK1_Frequency/(3*1000000));
	}

	//----------RADAR---------------
	prescalerRadar = 1;

	// Only have 16-bit timer
	// If sampling rate is too low, period will be too large.
	// So keep doubling the prescaler and halving the period.
	// Note that actual prescaler used in timer is prescaler+1, adjust at end.
	// TODO Add error check if sampling rate is too low.
	if (periodRadar > 0xFFFF) {
		periodRadar = periodRadar >> 1;
		prescalerRadar = 2;
	}

	while (periodRadar > 0xFFFF) {
		periodRadar = periodRadar >> 1;
		prescalerRadar = prescalerRadar << 1;
	}

	// Adjust
	prescalerRadar--;

	//----------AUDIO---------------
	prescalerAudio = 1;

	if (periodAudio > 0xFFFF) {
		periodAudio = periodAudio >> 1;
		prescalerAudio = 2;
	}

	while (periodAudio > 0xFFFF) {
		periodAudio = periodAudio >> 1;
		prescalerAudio = prescalerAudio << 1;
	}

	// Adjust
	prescalerAudio--;
	//-------------------------------

	//TIM_TimeBaseStructInit(&TIM_TimeBaseStructure);

	//RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);
	//RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM8, ENABLE);

	//-------------------------TIMER SETUP---------------------------------------------------------------------
	//AnanthAtSamraksh - setup a timer for Radar (TIM3)
	TIM_DeInit(TIM3);
	TIM_TimeBaseStructInit(&TIM_TimeBaseStructure);
	TIM_TimeBaseStructure.TIM_Period = (UINT16) periodRadar;	//125Hz @ 8MHz
	//TIM_TimeBaseStructure.TIM_Period = 48000;	//125Hz @ 8MHz
    //TIM_TimeBaseStructure.TIM_Period = 64000;	//125Hz @ 8MHz
    //TIM_TimeBaseStructure.TIM_Period = (UINT16)(period * 4);	//250Hz @ 8MHz; 1000/250 Hz
    //TIM_TimeBaseStructure.TIM_Prescaler = 0;
    TIM_TimeBaseStructure.TIM_Prescaler = (UINT16) prescalerRadar;
    TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseStructure.TIM_RepetitionCounter = 0x0000;
	TIM_TimeBaseInit(TIM3, &TIM_TimeBaseStructure);
	TIM_SelectOutputTrigger(TIM3, TIM_TRGOSource_Update);

	// Set up the compare channel
	/*TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInitStructure.TIM_Pulse = 32000-1;
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
	TIM_OC4Init(TIM4, &TIM_OCInitStructure);
	TIM_OC4PreloadConfig(TIM4, TIM_OCPreload_Enable);
	TIM_ARRPreloadConfig(TIM4, ENABLE);*/


	//AnanthAtSamraksh - setup a timer for Audio (TIM8)
	TIM_DeInit(TIM8);
	TIM_TimeBaseStructInit(&TIM_TimeBaseStructure);
	TIM_TimeBaseStructure.TIM_Period = (UINT16) periodAudio;	//2KHz @ 8MHz
	//TIM_TimeBaseStructure.TIM_Period = 24000;	//2KHz @ 8MHz
	//TIM_TimeBaseStructure.TIM_Period = 4000;	//2KHz @ 8MHz
	//TIM_TimeBaseStructure.TIM_Period = (UINT16)(period / 2);	//2KHz @ 8MHz; 1000/2000 Hz
	TIM_TimeBaseStructure.TIM_Prescaler = (UINT16) prescalerAudio;
	TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseStructure.TIM_RepetitionCounter = 0x0000;
	TIM_TimeBaseInit(TIM8, &TIM_TimeBaseStructure);
	TIM_SelectOutputTrigger(TIM8, TIM_TRGOSource_Update);

	// Set up the compare channel
	/*TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInitStructure.TIM_Pulse = 16000-1;
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
	TIM_OC4Init(TIM3, &TIM_OCInitStructure);
	TIM_OC4PreloadConfig(TIM3, TIM_OCPreload_Enable);
	TIM_ARRPreloadConfig(TIM3, ENABLE);*/
	//-------------------------------------------------------------------------------------------------------------------




#ifdef NATIVE_TEST
    g_adcDriverBufferDualModePtr = g_adcDriverBufferDualMode;
    g_adcDriverBufferDualModePtrAudio = g_adcDriverBufferDualMode;
#else
    g_adcDriverBufferDualModePtr = (UINT32 *) private_malloc((sizeof(UINT32)) * adcNumSamplesRadar);
    //g_adcDriverBufferDualModePtr = (UINT32 *) private_malloc(3 * numSamples);
    //g_adcDriverBufferDualModePtrAudio = (UINT32 *) private_malloc(sizeof(UINT32) * numSamples);
#endif

