Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/adc/hal_adc_driver.cpp
  /* ADC1 regular channel10 configuration */
  ADC_RegularChannelConfig(ADC1, EMOTE_ADC_CHANNEL[0], 1, sampTime);
  ADC_RegularChannelConfig(ADC2, EMOTE_ADC_CHANNEL[1], 1, sampTime);
  ADC_RegularChannelConfig(ADC3, EMOTE_ADC_CHANNEL[2], 1, sampTime);

  /* Enable ADC1 DMA */
  //ADC_DMACmd(ADC1, ENABLE);

  /* Enable ADC1 */
  ADC_Cmd(ADC1, ENABLE);
  ADC_Cmd(ADC2, ENABLE);
  ADC_Cmd(ADC3, ENABLE);

  /* Enable ADC1 reset calibaration register */
  ADC_ResetCalibration(ADC1);
  ADC_ResetCalibration(ADC2);
  ADC_ResetCalibration(ADC3);

  /* Check the end of ADC1 reset calibration register */
  while(ADC_GetResetCalibrationStatus(ADC1));
  while(ADC_GetResetCalibrationStatus(ADC2));
  while(ADC_GetResetCalibrationStatus(ADC3));

  /* Start ADC1 calibaration */
  ADC_StartCalibration(ADC1);
  ADC_StartCalibration(ADC2);
  ADC_StartCalibration(ADC3);

  /* Check the end of ADC1 calibration */
  while(ADC_GetCalibrationStatus(ADC1));
  while(ADC_GetCalibrationStatus(ADC2));
  while(ADC_GetCalibrationStatus(ADC3));
}

void hal_adc_init(uint8_t sampTime)
{
	ADC_RCC_Configuration();
	ADC_NVIC_Configuration();
	ADC_GPIO_Configuration();
	ADC_Configuration(sampTime);
}

uint8_t hal_adc_getData(uint16_t *dataBuf, uint8_t startChannel, uint8_t numChannels)
{
	uint8_t i,j;

	if (startChannel > 2 || (startChannel + numChannels > 3))
		return 0;

	for (j=startChannel; j < startChannel+numChannels; j++)
	{
		ADC_SoftwareStartConvCmd(((ADC_TypeDef *) ADC_MODULE[j]), ENABLE);
	}

	for(i=0;i<50;i++);

	for (j=0; j<numChannels; j++)
	{
		dataBuf[j] = ADC_GetConversionValue((ADC_TypeDef *) ADC_MODULE[j+startChannel]);
	}

	return 1;
}


extern "C"
{
	void ADC_HAL_HANDLER(void *param)
	{
		CPU_GPIO_SetPinState((GPIO_PIN)23, TRUE);

		//hal_printf("ADC_HAL_HANDLER\n");
		static int buffer_index = 0;
		//buffer_index++;

		//g_timeStamp = HAL_Time_CurrentTicks();
		//TIM_Cmd(TIM8, ENABLE);		//Audio
		//memset(g_adcUserBufferChannel3Ptr, 0, adcNumSamples);


		if(buffer_index < adcNumSamplesAudio)
			g_adcUserBufferChannel3Ptr[buffer_index++] = ADC_GetConversionValue(ADC3);

		CPU_GPIO_SetPinState((GPIO_PIN)23, FALSE);

		if(buffer_index == adcNumSamplesAudio && DMA_Callback == true)
		{
			g_timeStamp = HAL_Time_CurrentTicks();
			CPU_GPIO_SetPinState((GPIO_PIN)2, TRUE);
			//CPU_GPIO_SetPinState((GPIO_PIN)8, TRUE);
			//CPU_GPIO_SetPinState((GPIO_PIN)4, TRUE);
			buffer_index = 0;
			DMA_Callback = false;
			CPU_GPIO_SetPinState((GPIO_PIN)2, FALSE);
			//CPU_GPIO_SetPinState((GPIO_PIN)8, FALSE);
			//CPU_GPIO_SetPinState((GPIO_PIN)4, FALSE);
			g_callback(&g_timeStamp);
		}

		//g_callback(&g_timeStamp);

		/* Clear ADC1 JEOC pending interrupt bit */
		//ADC_ClearITPendingBit(ADC3, ADC_IT_EOC);		//Does not make any difference

	}

	void DMA_HAL_HANDLER_FOR_RADAR(void *param)
	{
		CPU_GPIO_SetPinState((GPIO_PIN)25, TRUE);
		//hal_printf("DMA_HAL_HANDLER_FOR_RADAR\n");
		// Record the time as close to the completion of sampling as possible
		g_timeStamp = HAL_Time_CurrentTicks();

		if(DMA_GetFlagStatus(DMA1_FLAG_TC1) != RESET)
		{
			DMA_ClearITPendingBit(DMA1_FLAG_TC1);

			if(!dualADCMode)
			{
				memcpy(g_adcUserBufferChannel1Ptr, g_adcDriverBufferDualModePtr, adcNumSamplesRadar * sizeof(UINT16));
			}
			else
			{
				// Possible memory corruption if adcNumSamples != length of g_adcDriverBufferDualModePtr
				// Possible only while conducting native tests as C# programs use dynamic memory
				// allocated from the heap
				// BTW this is because the hardware in dual mode stores in the most significant bits of
				// ADC1_DR the result of ADC2 and the least significant bits of ADC1_DR the result
				// of ADC1. Pretty cool  !!!

				for(UINT16 i = 0; i < adcNumSamplesRadar; i++)
				{
					g_adcUserBufferChannel1Ptr[i] = (g_adcDriverBufferDualModePtr[i] & 0xffff);
					g_adcUserBufferChannel2Ptr[i] = (g_adcDriverBufferDualModePtr[i] >> 16);
					//g_adcUserBufferChannel3Ptr[i] = (g_adcDriverBufferDualModePtrAudio[i] >> 16);
				}

				CPU_GPIO_SetPinState((GPIO_PIN)25, FALSE);

				if(!DMA_Callback)
					DMA_Callback = true;
			}

			if(batchModeADC)
			{
				// Disable the trigger if the batch mode is true
				TIM_Cmd(TIM3, DISABLE);
				TIM_Cmd(TIM8, DISABLE);
			}
		}
	}


	void DMA_HAL_HANDLER_FOR_AUDIO(void *param)
	{
		CPU_GPIO_SetPinState((GPIO_PIN)23, TRUE);
		//hal_printf("DMA_HAL_HANDLER_FOR_AUDIO\n");
		// Record the time as close to the completion of sampling as possible
		g_timeStamp = HAL_Time_CurrentTicks();
		CPU_GPIO_SetPinState((GPIO_PIN)23, FALSE);

		if(DMA_GetFlagStatus(DMA2_FLAG_TC5) != RESET)
		{
			DMA_ClearITPendingBit(DMA2_IT_TC5);

			if(!dualADCMode)
			{
				memcpy(g_adcUserBufferChannel3Ptr, g_adcDriverBufferDualModePtrAudio, adcNumSamples * sizeof(UINT16));
			}
			else
			{
				// Possible memory corruption if adcNumSamples != length of g_adcDriverBufferDualModePtr
				// Possible only while conducting native tests as C# programs use dynamic memory
				// allocated from the heap
				// BTW this is because the hardware in dual mode stores in the most significant bits of
				// ADC1_DR the result of ADC2 and the least significant bits of ADC1_DR the result
				// of ADC1. Pretty cool  !!!

				//Sample audio alone

				//g_adcUserBufferChannel3Ptr = (uint16_t*)ADC_RAW[2];
				for(UINT16 i = 0; i < adcNumSamples; i++)
				{
					//hal_printf("audio ; g_adcDriverBufferDualModePtrAudio[i]: %d \n", g_adcDriverBufferDualModePtrAudio[i]);
					g_adcUserBufferChannel3Ptr[i] = (g_adcDriverBufferDualModePtrAudio[i] & 0xffff);
					//hal_printf("audio ; g_adcUserBufferChannel3Ptr[i]: %d; g_adcDriverBufferDualModePtrAudio[i] >> 16: %d \n", g_adcUserBufferChannel3Ptr[i], g_adcDriverBufferDualModePtrAudio[i] >> 16);
				}
			}

			// Call the user with the current value of ticks
			//if(g_adcUserBufferChannel3Ptr[adcNumSamples] != 0)
				g_callback(&g_timeStamp);

			if(batchModeADC)
			{
				// Disable the trigger if the batch mode is true
				TIM_Cmd(TIM3, DISABLE);
				TIM_Cmd(TIM8, DISABLE);
			}
		}
	}


	void DMA_HAL_HANDLER(void *param)
	{
		CPU_GPIO_SetPinState((GPIO_PIN)23, TRUE);
		//hal_printf("DMA_HAL_HANDLER\n");
		// Record the time as close to the completion of sampling as possible
		g_timeStamp = HAL_Time_CurrentTicks();

		if(DMA_GetFlagStatus(DMA1_FLAG_TC1) != RESET)
		{
			DMA_ClearITPendingBit(DMA1_IT_TC1);

			if(!dualADCMode)
			{
				memcpy(g_adcUserBufferChannel1Ptr, g_adcDriverBufferChannel1Ptr, adcNumSamples * sizeof(UINT16));
			}
			else
			{
				// Possible memory corruption if adcNumSamples != length of g_adcDriverBufferDualModePtr
				// Possible only while conducting native tests as C# programs use dynamic memory
				// allocated from the heap
				// BTW this is because the hardware in dual mode stores in the most significant bits of
				// ADC1_DR the result of ADC2 and the least significant bits of ADC1_DR the result
				// of ADC1. Pretty cool  !!!
				for(UINT16 i = 0; i < adcNumSamples; i++)
				{
					g_adcUserBufferChannel1Ptr[i] = (g_adcDriverBufferDualModePtr[i] & 0xffff);
					g_adcUserBufferChannel2Ptr[i] = (g_adcDriverBufferDualModePtr[i] >> 16);
				}
			}

			CPU_GPIO_SetPinState((GPIO_PIN)23, FALSE);
			// Call the user with the current value of ticks
			g_callback(&g_timeStamp);

			if(batchModeADC)
			{
				// Disable the trigger if the batch mode is true
				TIM_Cmd(TIM4, DISABLE);
			}

		}
	}

	/*void TIM_HAL_HANDLER(void *param)
	{
		//hal_printf("TIM_HAL_HANDLER\n");
		//if(TIM_GetFlagStatus(TIM4, TIM_IT_CC4))
		if(TIM_GetITStatus(TIM4, TIM_IT_CC4))
		{
			TIM_ClearITPendingBit(TIM4, TIM_IT_CC4);
		}
	}*/
}

